Documents/ЗаписьКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ЗаписьКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаОказана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОписаниеУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>УДАЛИТЬ</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

HTTPServices/customerOrders/Ext/Module.bsl
Функция createOrderPOST(Запрос)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку()); //1
	ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON, Ложь);
	ЧтениеJSON.Закрыть();
	
	НоваяЗапись = Документы.ЗаписьКлиента.СоздатьДокумент(); //2
	НоваяЗапись.Сотрудник = Справочники.Сотрудники.НайтиПоНаименованию(ДанныеЗапроса.Сотрудник);
	НоваяЗапись.Дата = ТекущаяДата();
	НоваяЗапись.ДатаЗаписи = ПрочитатьДатуJSON(ДанныеЗапроса.ДатаЗаписи, ФорматДатыJSON.ISO);//3
	НоваяЗапись.Клиент = Справочники.Пользователи.НайтиПоКоду(ДанныеЗапроса.GUIDПользователя).Клиент;
	
	Для Каждого СтруктураУслуги Из ДанныеЗапроса.МассивУслуг Цикл //4
		НоваяУслуга = НоваяЗапись.ОписаниеУслуг.Добавить();
		НоваяУслуга.Услуга  = Справочники.Номенклатура.НайтиПоНаименованию(СтруктураУслуги.Услуга);
		НоваяУслуга.Стоимость = Число(СтруктураУслуги.Цена);
		НоваяУслуга.Количество = Число(СтруктураУслуги.Количество);
		НоваяУслуга.Сумма = Число(СтруктураУслуги.Сумма);
	КонецЦикла;
	
	Попытка
		НоваяЗапись.Записать(РежимЗаписиДокумента.Проведение); //5
		ТекстОтвета = "Создан и проведен документ " + НоваяЗапись.Номер;
		Ответ = Новый HTTPСервисОтвет(200);
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		ТекстОтвета = "Произошла ошибка при проведении документа " + НоваяЗапись.Номер + "! ";
	КонецПопытки;
	
	Ответ.УстановитьТелоИзСтроки(ТекстОтвета);
	
	Возврат Ответ;
	
КонецФункции
